1
Содерж.
4
327
327: Примечание о содержании
0
8327000
0





330
330: Содержание (оглавление) 
1
8330000
5
330n.wss
@!330n



926
926: "Другие" авторы
1
0
5
926.wss

Формируются автоматически  из полей 922^w, 330^w, 925^w, 481^w. Автоматически не пополняются и не корректируются 


932
932: Служебное поле: N статьи для копирования
0
0
0


Номер статьи из полей "Содержание"/"Оглавление" или Сборника без общего загалавия при отсутствии поля "Содержание" для создания записи аналитического описания


