1
Редкие
14
391
391: Примечания о наличии автографов
1
8391000
5
391.wss




316
316: Примечания об особенностях экземпляра
1
0
5
316.wss




317
317: Примечания о происхождении экземпляра
1
0
5
317.wss




318
318: Примечания о действиях по сохранности док-та
1
0
5
318.wss

Действия, осуществляемые для обеспечения сохранности


398
398: Экслибрис
1
8398000
5
398.wss

Поле повторяется для разных инвентарей


395
395: Пометки автора
1
8395000
4





396
396: Пометки владельца коллекции
1
8396000
4





106
106: Физическая форма: бумажный носитель
0
0
5
106.wss




116
116: Кодированные данные.Графические материалы
1
0
5
116.wss




140
140: Кодированные данные.Общие характеристики
0
0
5
140.wss

Общая информация


141
141: Кодированные данные. Характеристики экземпляра
1
0
5
141.wss




399
399: Состояние (сохранность) предмета
1
8399000
5
399.wss

Поле повторяется для разных инвентарей


397
397: Примечание о технике изготовления предмета
1
8397000
4





929
929: Особенности экз-ра (разъединенные данные)
1
0
0


Формируются автоматически  из полей 316^b 316^c 


