Автор                         700 0   1 2 A=
Заглавие                      200 1   1 1 K=
Год издания                   210 7   1 0 g=
УДК                           675 0   1 1 U=
Ключевые слова                661 0   1 1 K=
Коллективный автор            710 3   1 1 K=
Язык                          101 0   1 0 j=
Рубрика ГАСНТИ                964 0   1 1 R=
Страна                        102 0   1 0 c=
Шифр хранения                 903 903 1 1 I=
Дата поступления с            907 0   1 0 @DP=                  3
Дата поступления по           908 0   1 0 @DP=                  4
Вид документа                 900 0   1 0 V=
Год/том/номер                 463 0   1 0 @                     5
Номер акта передачи           909 0   1 1 NAP=
Номер партии книг при выбытии 910 0   1 1 NKS2=
Носитель                      801 0   1 1 NOS=
Характер                      802 0   1 1 HD=
Раздел знаний                 803 0   1 1 RZD=
УДК/ББК                       804 0   1 1 U=
Другая классификация          805 0   1 1 RIN=

