3
Основное БО
Экземпляры.Систематизация
Технология
10
10
5
700
Первый автор - Заголовок описания
0
0
5
701.wss




701
Другие авторы
1
0
5
701.wss




200
Заглавие, дополнительные данные
0
0
5
200si.wss




923
Выпуск, часть (Номер - заглавие)
0
0
5
923.wss




210
Выходные данные 
1
0
5
210.wss




205
Сведения об издании
0
0
5
205.wss




215
Количественные характеристики
0
0
5
215.wss




300
Общие примечания
1
0
0


 


320
Примечания о наличии библиографии
0
0
1
320.mnu



R. -
225
Область серии                         
1
0
5
225i.wss




910
Сведения  об ЭКЗЕМПЛЯРАХ
1
0
5
910.wss
@!910



675
Индексы УДК
1
0
5
675.wss




908
Авторский знак
0
0
0


Таблицы Хавкиной


903
Шифр документа в БД
0
0
0

@!903
Строится автоматически. Необходимо КОРРЕКТИРОВАТЬ при изменении ИНДЕКСА


906
Систематический шифр
0
0
0





964
Индексы ГРНТИ
1
0
3
,R=,*
@!964



606
Предметная рубрика
1
0
5
pr.wss




327
Примечания о содержании
0
0
0





610
Ключевые слова
1
0
0


Не встречающиеся в других библиографических данных


331
Аннотация
0
0
4





907
Каталогизатор, дата
1
0
5
907.wss
@!907



950
Сведения о графических данных
1
0
0


Имя файла графических данных (с расширением)


951
Сведения о полном тексте
0
0
5
951.wss




920
Имя рабочего листа
0
0
1
920.mnu


IBIS

999
Количество выдач
0
3
0



0000000

