// This is an open source non-commercial project. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++ and C#: http://www.viva64.com

/* RussianNames.cs --
 * Ars Magna project, http://arsmagna.ru
 * -------------------------------------------------------
 * Status: poor
 */

#region Using directives

using JetBrains.Annotations;

using MoonSharp.Interpreter;

#endregion

// ReSharper disable StringLiteralTypo

namespace AM.AOT
{
    /// <summary>
    /// Достаточно широко распространенные русские имена и фамилии.
    /// </summary>
    [PublicAPI]
    [MoonSharpUserData]
    public static class RussianNames
    {
        #region Public methods

        /// <summary>
        /// Русские женские имена.
        /// </summary>
        [NotNull][ItemNotNull]
        public static string[] GetFemalePersonalNames()
        {
            return new[]
            {
                "Авдотья", "Агафья", "Аглая", "Агнесса", "Аграфена",
                "Агриппина", "Аделаида", "Аксинья", "Акулина", "Алевтина",
                "Александра", "Александрина", "Алена", "Алина", "Алиса",
                "Алла", "Альбина", "Альма", "Анастасия", "Ангелина",
                "Анжела", "Анжелика", "Анжелина", "Анна", "Антонина",
                "Антония", "Анфиса", "Аполлинария", "Арина", "Ася",
                "Барбара", "Болеслава", "Борислава", "Бронислава",
                "Валентина", "Валерия", "Варвара", "Василиса", "Вера",
                "Вероника", "Виктория", "Гала", "Галина", "Глафира",
                "Гуля", "Дана", "Дарья", "Ева", "Евгения", "Евдокия",
                "Евпраксия", "Евфросиния", "Екатерина", "Елена",
                "Елизавета", "Есфирь", "Епистима", "Ермиония", "Ефимия",
                "Ефросинья", "Жанна", "Зинаида", "Злата", "Зоя", "Инга",
                "Инесса", "Инна", "Иоанна", "Ираида", "Ирина", "Ия",
                "Катерина", "Карина", "Каролина", "Кира", "Клавдия",
                "Клара", "Ксения", "Лада", "Лана", "Лариса", "Лидия",
                "Лилия", "Любовь", "Людмила", "Магдалина", "Маргарита",
                "Марианна", "Марина", "Мария", "Марфа", "Матрена",
                "Мирослава", "Надежда", "Наталья", "Наталия", "Нина",
                "Нинель", "Нонна", "Оксана", "Октябрина", "Ольга",
                "Пелагея", "Пинна", "Полина", "Прасковья", "Рада", "Раиса",
                "Римма", "Роза", "Роксана", "Руфина", "Светлана",
                "Серафима", "Слава", "Снежана", "София", "Софья",
                "Сюзанна", "Таисия", "Тамара", "Татьяна", "Ульяна",
                "Устинья", "Фаина", "Феврония", "Фекла", "Феодора",
                "Целестина", "Юлиана", "Юлия", "Юстина", "Яна", "Ярослава"
            };
        }

        /// <summary>
        /// Русские мужские имена.
        /// </summary>
        [NotNull][ItemNotNull]
        public static string[] GetMalePersonalNames()
        {
            return new[]
            {
                "Авдей", "Аверкий", "Авксентий", "Агафон", "Александр",
                "Алексей", "Альберт", "Альвиан", "Анатолий", "Андрей",
                "Антон", "Антонин", "Анфим", "Аристарх", "Аркадий",
                "Арсений", "Артем", "Артур", "Архипп", "Афанасий",
                "Богдан", "Борис", "Вадим", "Валентин", "Валерий",
                "Валерьян", "Варлам", "Варфоломей", "Василий", "Венедикт",
                "Вениамин", "Викентий", "Виктор", "Виссарион", "Виталий",
                "Владимир", "Владислав", "Владлен", "Влас", "Всеволод",
                "Вячеслав", "Гавриил", "Галактион", "Геласий", "Геннадий",
                "Георгий", "Герасим", "Герман", "Глеб", "Гордей", "Григорий",
                "Даниил", "Демид", "Демьян", "Денис", "Дмитрий", "Добрыня",
                "Донат", "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсей",
                "Евстафий", "Егор", "Емельян", "Еремей", "Ермолай", "Ефим",
                "Ждан", "Зиновий", "Иакинф", "Иван", "Игнатий", "Игорь",
                "Иларион", "Илья", "Иннокентий", "Ираклий", "Ириней",
                "Исидор", "Иулиан", "Касьян", "Ким", "Кирилл", "Климент",
                "Кондрат", "Константин", "Корнилий", "Кузьма", "Куприян",
                "Лаврентий", "Лев", "Леонид", "Леонтий", "Лука", "Лукий",
                "Лукьян", "Магистриан", "Макар", "Максим", "Марк", "Мартын",
                "Матвей", "Мелентий", "Мирон", "Мирослав", "Митрофан",
                "Михаил", "Мстислав", "Мэлор", "Назар", "Нестор", "Никанор",
                "Никита", "Никифор", "Николай", "Никон", "Олег", "Онисим",
                "Павел", "Пантелеймон", "Парфений", "Петр", "Платон",
                "Порфирий", "Потап", "Прокопий", "Протасий", "Прохор",
                "Разумник", "Родион", "Роман", "Ростислав", "Руслан",
                "Савва", "Савелий", "Самуил", "Святополк", "Святослав",
                "Севастьян", "Семен", "Сергей", "Сильвестр", "Сильвестр",
                "Созон", "Спиридон", "Станислав", "Степан", "Тарас",
                "Тимофей", "Тимур", "Тихон", "Трифон", "Трофим", "Фаддей",
                "Федор", "Федосей", "Федот", "Феликс", "Феоктист", "Филат",
                "Филипп", "Фома", "Харитон", "Христофор", "Эдуард", "Эраст",
                "Юлиан", "Юрий", "Юстин", "Яков", "Якун", "Ярослав"
            };
        }

        /// <summary>
        /// Список общерусских фамилий.
        /// </summary>
        [NotNull][ItemNotNull]
        public static string[] GetSurnames()
        {
            return new[]
            {
                "Абрамов", "Авдеев", "Агафонов", "Аксенов",
                "Александров", "Алексеев", "Андреев", "Анисимов",
                "Антонов", "Артемьев", "Архипов", "Афанасьев",
                "Баранов", "Белов", "Белозеров", "Белоусов", "Беляев",
                "Беляков", "Беспалов", "Бирюков", "Блинов", "Блохин",
                "Бобров", "Бобылев", "Богданов", "Большаков", "Борисов",
                "Брагин", "Буров", "Быков", "Васильев", "Веселов",
                "Виноградов", "Вишняков", "Владимиров", "Власов", "Волков",
                "Воробьев", "Воронов", "Воронцов", "Гаврилов", "Галкин",
                "Герасимов", "Голубев", "Горбачев", "Горбунов", "Гордеев",
                "Горшков", "Григорьев", "Гришин", "Громов", "Гуляев",
                "Гурьев", "Гусев", "Гущин", "Давыдов", "Данилов",
                "Дементьев", "Денисов", "Дмитриев", "Доронин", "Дорофеев",
                "Дроздов", "Дьячков", "Евдокимов", "Евсеев", "Егоров",
                "Елисеев", "Емельянов", "Ермаков", "Ершов", "Ефимов",
                "Ефремов", "Жданов", "Жуков", "Журавлев", "Зайцев",
                "Захаров", "Зимин", "Зиновьев", "Зуев", "Зыков", "Иванов",
                "Игнатов", "Игнатьев", "Ильин", "Исаев", "Исаков", "Кабанов",
                "Казаков", "Калашников", "Калинин", "Капустин", "Карпов",
                "Кириллов", "Киселев", "Князев", "Ковалев", "Козлов",
                "Колесников", "Колобов", "Комаров", "Комиссаров",
                "Кондратьев", "Коновалов", "Кононов", "Константинов",
                "Копылов", "Корнилов", "Королев", "Костин", "Котов",
                "Кошелев", "Красильников", "Крылов", "Крюков", "Кудрявцев",
                "Кудряшов", "Кузнецов", "Кузьмин", "Кулагин", "Кулаков",
                "Куликов", "Лаврентьев", "Лазарев", "Лапин", "Ларионов",
                "Лебедев", "Лихачев", "Лобанов", "Логинов", "Лукин",
                "Лыткин", "Макаров", "Максимов", "Мамонтов", "Марков",
                "Мартынов", "Маслов", "Матвеев", "Медведев", "Мельников",
                "Меркушев", "Миронов", "Михайлов", "Михеев", "Мишин",
                "Моисеев", "Молчанов", "Морозов", "Муравьев", "Мухин",
                "Мясников", "Назаров", "Наумов", "Некрасов", "Нестеров",
                "Никитин", "Никифоров", "Николаев", "Никонов", "Новиков",
                "Носков", "Носов", "Овчинников", "Одинцов", "Орехов",
                "Орлов", "Осипов", "Павлов", "Панов", "Панфилов", "Пахомов",
                "Пестов", "Петров", "Петухов", "Поляков", "Пономарев",
                "Попов", "Потапов", "Прохоров", "Рогов", "Родионов",
                "Рожков", "Романов", "Русаков", "Рыбаков", "Рябов",
                "Савельев", "Савин", "Сазонов", "Самойлов", "Самсонов",
                "Сафонов", "Селезнев", "Селиверстов", "Семенов", "Сергеев",
                "Сидоров", "Силин", "Симонов", "Ситников", "Смирнов",
                "Соболев", "Соколов", "Соловьев", "Сорокин", "Степанов",
                "Стрелков", "Субботин", "Суворов", "Суханов", "Сысоев",
                "Тарасов", "Терентьев", "Тетерин", "Тимофеев", "Титов",
                "Тихонов", "Третьяков", "Трофимов", "Туров", "Уваров",
                "Устинов", "Фадеев", "Федосеев", "Федотов", "Филатов",
                "Филиппов", "Фокин", "Фомин", "Фомичев", "Фролов",
                "Федоров", "Харитонов", "Хохлов", "Цветков", "Чернов",
                "Шарапов", "Шаров", "Шашков", "Шестаков", "Шилов", "Ширяев",
                "Шубин", "Щербаков", "Щукин", "Юдин", "Яковлев", "Якушев"
            };
        }

        #endregion
    }
}
