/* Isni.cs --
 * Ars Magna project, http://arsmagna.ru
 * -------------------------------------------------------
 * Status: poor
 */

#region Using directives

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

#endregion

namespace ManagedIrbis.Identifiers
{
    //
    // Международный идентификатор стандартных наименований
    // Международный стандартный идентификатор имени
    // (англ. International Standard Name Identifier,
    // сокращённо — англ. ISNI) — метод для уникальной идентификации
    // создателей и издателей таких видов медиа-контента, как книги,
    // телевизионные передачи, газетные статьи и др.
    // Такой идентификатор состоит из 16 цифр, разделенных на четыре блока.
    //
    // Стандарт был разработан под эгидой международной организации
    // по стандартизации (ISO), как проект международного стандарта 27729.
    // Действительный стандарт был опубликован 15 марта 2012 года.
    // За разработку стандарта отвечает технический комитет ISO 46,
    // подкомитет 9 (TC 46/SC 9).
    //
    // ISNI может быть использован для разрешения неоднозначности имён,
    // которые в противном случае могли быть перепутаны, и связывает
    // данные об именах, которые используются во всех отраслях
    // промышленности средств массовой информации.
    //
    // На территории России ISNI присваивает Российское авторское общество
    // КОПИРУС, которое является членом международного агентства ISNI-IA.
    //
    // См. https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D0%B6%D0%B4%D1%83%D0%BD%D0%B0%D1%80%D0%BE%D0%B4%D0%BD%D1%8B%D0%B9_%D0%B8%D0%B4%D0%B5%D0%BD%D1%82%D0%B8%D1%84%D0%B8%D0%BA%D0%B0%D1%82%D0%BE%D1%80_%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%B0%D1%80%D1%82%D0%BD%D1%8B%D1%85_%D0%BD%D0%B0%D0%B8%D0%BC%D0%B5%D0%BD%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B9
    // https://en.wikipedia.org/wiki/International_Standard_Name_Identifier
    //



    class Isni
    {



    }
}
