6
Коды
Основное БО
Расширенное
Специфические
Экз-ры
@Techn
9
12
22
15
1
0
900
900: Коды : тип, вид, характер документа
0
8900000
5
900.wss
@!900



102
102: Страна
1
8102000
1
str.mnu\\2
@!102

RU

101
101: Язык основного текста
1
8101000
1
jz.mnu\\2
@!101

rus

911
911: Язык резюме
1
8911000
1
jz.mnu\\2
@!101



919
919: Язык документа (дополн. данные)
1
8919000
5
919.wss


^Arus^N02^KPSBO

10
10: ISBN, Цена                      
1
8010000
5
10.wss
@!10



11
11: ISSN                          
1
8011000
5
11.wss
@!11



19
19: Идентификац. номер нетекстового материала
1
8019000
5
19.wss
@!19
Каталогизируемый документ не является традиционным текстовым материалом


904
904: Шифр приложения, хранящегося отдельно
1
8904000
5
904.wss

Приложение, вышедшее вместе с каталогизируемым основным документом, но хранящееся отдельно от него (включая приложение на нетрадиционном носителе)


700
700: 1-й автор - Заголовок описания
0
8700000
5
701.wss
@!700d
            ОПИСАНИЕ типа "ПОД АВТОРОМ"       Заполнять, если авторов не больше 3-х


701
701: Другие индивидуальные авторы
1
8701000
5
701.wss
@!701
Вводятся в поисковый словарь и в "Сведения об ответственности"


702
702: Редакторы, составители, композиторы ...
1
8702000
5
702.wss
@!702
Вводятся в поисковый словарь и в "Сведения об ответственности"


711
711: Другие коллективы, не входящие в заголовок описания
1
8711000
5
711k.wss

Вводятся в поисковый словарь и в "Сведения об ответственности"


972
972: Другие врем.коллективы, не входящие в заголовок описания
1
8972000
5
972vk.wss

Вводятся в поисковый словарь и в "Сведения об ответственности"


200
200: Основное заглавие, доп.данные
0
8200000
5
200bz.wss

Если в одной книге (печатной единице) помещено несколько томов (выпусков), то в поле вводятся только данные, общие для всей книги


923
923: Выпуск, часть (Номер-заглавие)
1
8923000
5
923.wss

Повторяется для каждой части, помещенной в той же печатной единице


922
922: Статьи сборника без общего заглавия
1
8922000
5
922n.wss
@!922n
Сборник без общего заглавия


925
925: Несколько томов в одной книге
1
0
5
925.wss
@!925n
Повторяется для КАЖДОГО тома, помещенного в той же печатной единице, а также для разных произведений из одного тома, имеющих отличительные данные, кроме заглавия


205
205: Сведения об издании
1
8205000
5
205.wss




210
210: Выходные данные 
1
8210000
5
210.wss
@!210d
Повторяется для каждого издательства


215
215: Количественные характеристики
1
8215000
5
215.wss

Повторяется для разных физических носителей


300
300: Общие примечания
1
8300000
0


Включая дополнения и изменения НТД 


912
912: Примечания о языке
1
8912000
0





320
320: Примечания о наличии библиографии
0
8320000
1
320.mnu



R. - 
390
390: Список библиографии
1
0
5
390.wss




314
314: Примечания об интеллект. ответственности
0
8314000
0





328
328: Примечания о диссертации
0
8328000
5
328.wss




225
225: ОБЛАСТЬ СЕРИИ                         
1
8225000
5
225.wss
@!11s
Серия, в которую входит  монография или том многотомника


510
510: Параллельные заглавия
1
8510000
5
510.wss




517
517: Разночтение заглавий
1
8517000
5
517.wss

На корешке, на обложке, на колонтитуле ...


541
541: Перевод заглавия
0
8541000
0





924
924: "Другое" заглавие
0
8924000
0


Если заглавие дано аббревиатурой, здесь дается расшифровка и наоборот


921
921: Транслитерированное заглавие
0
8921000
5
921.wss




503
503: Унифицированный заголовок формы
0
8503000
5
503.wss




421
421: Самостоятельное приложение
1
8421000
5
421.wss

Каталогизируется основной документ, к которому имеется самостоятельное приложение


422
422: Издание, к которому относится  приложение
2
8422000
5
422.wss

Каталогизируемый документ является приложением


454
454: Оригинал переводного издания
1
8454000
5
454.wss
@!454n
Книга/Том мн-ка - переводное издание


451
451: Параллельное издание на том же носителе
1
8451000
5
451.wss

Параллельное издание или версия каталогизируемого издания на том же носителе


452
452: Параллельное издание на другом носителе
1
8452000
5
452.wss

Параллельное издание или версия каталогизируемого издания на другом носителе


481
481: В томе подборки также переплетены ...
1
8481000
5
481spn.wss
@!481n
Другие единицы, кроме первой, которые также переплетены в "искусственно составленной подборке"


932
932: Служебное поле: № поля 481 для копирования
0
0
0


Номер поля 481 (интервал номеров) для создания записи АЛЛИГАТА (аналитического описания) 


488
488: Другие связанные издания
1
0
5
488spn.wss
@!488n



993
993: Копия документа на другом носителе, которая хранится отдельно
1
8993000
5
993.wss

Копия документа (например, микрофильм или микрофиша, или CD-ROM), сделанная в библиотеке


230
230: Электронный ресурс - Вид и объем
1
8230000
5
230.wss

Повторяется для каждого электронного ресурса


337
337: Электронный ресурс - Примечания 
1
0
5
337.wss

Повторяется для каждого электронного ресурса


135
135: Электронный ресурс - Коды
1
8135000
5
135.wss

Повторяется для основного документа и приложения


982
982: Патент, Отчет о НИР, НТД и ЮД - спец. сведения 
1
8982000
5
982.wss

Область Специфических сведений


916
916: ФХ (физич. характеристики): Кинофильм 
1
8916000
5
916.wss

Повторяется для основного документа и приложения


915
915: ФХ: Визуально-проекционный материал 
1
8915000
5
915.wss

Повторяется для основного документа и приложения


115
115: ФХ: Видеозапись 
1
8115000
5
115.wss

Повторяется для основного документа и приложения


123
123: ФХ: Картографический материал 
1
8123000
5
123.wss

Повторяется для основного документа и приложения


509
509: Заголовок картографической записи
1
0
5
509.wss




125
125: Звукозапись и нотные издания
1
8125000
5
125.wss

Повторяется для основного документа и приложения


36
36: Нотный инципит
1
0
5
36ni.wss

Заполнять, если в документе несколько произведений или частей, иначе - заполняется поле 125


126
126: ФХ: Звукозапись 
1
8126000
5
126.wss

Повторяется для основного документа и приложения


130
130: ФХ: Микроформа 
1
8130000
5
130.wss

Повторяется для основного документа и приложения


106
106: ФХ: Бумажный носитель
1
8106000
5
106.wss

Заполняется, если документ не обычной ПЕЧАТНОЙ формы. Повторяется для основного документа и приложения


239
239: Служебное поле-разделенные сист. требования к ЭР 
1
0
0


"Разделенные" системные требования к ЭР - формируются автоматически из 230^D, если в данных содержится " ; " (пробел ; пробел)


910
910: Сведения  об ЭКЗЕМПЛЯРАХ
1
8910000
5
910.wss
@!910



