1
Систематизация
20
675
675: Индексы УДК
1
8675000
5
675.wss




621
621: Индексы ББК
1
8621000
5
621.wss

УДК не используется


686
686: Индексы другой классификации
1
8686000
1
rubin.mnu\\2

УДК и ББК не используются


908
908: Авторский знак
0
8908000
1
hav.mnu\\2

Таблицы Хавкиной


903
903: Шифр документа в БД
0
8903000
0

@!903
Строится автоматически из ИНДЕКСА и авт.знака


906
906: Систематический шифр
0
8906000
0





60
60: Раздел знаний
0
8060000
1
rzn.mnu




964
964: Индексы ГРНТИ
1
8964000
3

@!964



606
606: Предметная рубрика
1
8606000
5
pr31.wss
@!606



607
607: Географическая рубрика
1
8606000
5
gr31.wss
@!607



690
690: Издательский индекс
1
8690000
5
ii.wss




965
965: Дескрипторы
1
8965000
11




R,  
610
610: Ненормированные ключевые слова
1
8610000
2
,K=,

Не встречающиеся в других библиографических данных ("Свободное индексирование")

R, 
600
600:Персоналия - имя лица и/или заглавие  (о нем, о произв.)
1
8600000
5
600n.wss
@!600


Сведения о лице или лице и заглавии или ТОЛЬКО о заглавии, описываемых в документе
601
601:Персоналия - коллектив или/и заглавие (о нем) 
1
8601000
5
601n.wss
@!601


Сведения о коллективе или коллективе и заглавии, описываемых в документе
331
331: Аннотация
1
8331000
4





619
619: Служебное поле-разделенные подрубрики
1
0
5
619.wss

Формируются автоматически, если ^D,^O,^H (в 606 и 607) или ^8,^O,^J (в 600 и 601) содержат "; " (; пробел)


932
932: Служебное поле: N поля 600 для копирования
0
0
0


Номер поля 600 для создания "Вложенной" записи


996
996:MeSH - главная
1
0
13
irbis:1,,,mesh_wn,R=0?dbname_default=mesh&checkname=CHECKINDEX&checkpft=meshac_wn




995
995:MeSH - неглавная
1
0
13
irbis:1,,,mesh_wn,R=0?dbname_default=mesh&checkname=CHECKINDEX&checkpft=meshac_wn




