1
КО
7
691
691: ВУЗ (Учебная литература) 
1
8691100
5
691ko.wss

К задаче Книгообеспеченность


61
61: Дисциплина потенциальная
1
0
1
rzpd.mnu

К задаче Книгообеспеченность


694
694: Заявка на учебную литературу
1
0
5
694ko.wss




692
692: ВУЗ: архив ККО 
1
0
5
692.wss

Формируется заданием глоб. корректуры


693
693: ВУЗ: текущие значения ККО
1
0
5
693.wss

Формируется заданием на связь


699
699: ВУЗ (Аналог)
1
0
5
699.wss
@!699
Заполнять для аналогичных учебников разных изданий (в ПЕРВОЙ записи и ее аналогах) 


943
943: Архивные данные удаления дисциплин
1
0
5
691.wss

Формируются при выполнении пакетного задания удаления дисциплин из учебника


