7
Дублетность
@BOuni
@Index
@Content
@KO
@RD
@KRV
11
0
0
0
0
0
0
700
700: 1-й  автор - Заголовок описания
0
8001000
5
701d.wss
@!700d
            ОПИСАНИЕ типа "ПОД АВТОРОМ"       Заполнять, если авторов не больше 3-х


710
710: 1-й коллектив - Заголовок описания
0
8001000
5
710k.wss
@!710d
               ОПИСАНИЕ типа "ПОД КОЛЛЕКТИВОМ"


971
971: 1-й Врем.коллектив - заголовок описания
0
8971000
5
971vk.wss

Заполнять, если временный коллектив (конференция,симпозиум) входит в заголовок ВМЕСТЕ с коллективом


200
200: Заглавие
0
8001000
5
200d.wss
@!200d



923
923: Выпуск, часть (Номер-заглавие)
1
8001000
5
923.wss




210
210: Год издания
1
8001000
5
210d.wss
@!210d



10
10: ISBN                    
1
8001000
5
10.wss
@!10
       ISBN участвует в сверке на дублетность, если описание - дублет по библиографическим данным


19
19: Идентификац. № нетекстового материала
1
8001000
5
19.wss
@!19
Каталогизируемый документ не является традиционным текстовым материалом. Номер участвует в сверке на дублетность, если описание - дублет по биб. данным


215
215: Объем 
1
8001000
5
215d.wss
@!kd
Повторяется для разных физических носителей


920
920: Имя рабочего листа
0
8920000
1
920.mnu


PAZK

900
900: Вид документа
0
0
5
900.wss


^B05

